{
  "show" : false,
  "a_rate_threashold" : "34",
  "show_a_rate" : false,
  "publications" :
  [ 

    { "key"       : "icse2024",
      "featured"  : "true",
      "thesis"    : "false",
      "bibtex"    : "bib/2024-icse.bib",
      "title"     : "ROSInfer: Statically Inferring Behavioral Component Models for ROS-based Robotics Systems",
      "date"      : "2024-04-15",
      "a_rate"    : "21.2",
      "project"   : "rosinfer",
      "authors"   : [ "me", "CT", "DG", "CLG"],
      "published" : "ICSE '24: 46th International Conference on Software Engineering",
      "caption"   : "Robotics systems are complex, safety-critical systems that can consist of hundreds of software components that interact with each other dynamically during run time. Software components of robotics systems often exhibit reactive, periodic, and state-dependent behavior. Incorrect component composition can lead to unexpected behavior, such as components passively waiting for initiation messages that never arrive. Model-based software analysis is a common technique to identify incorrect behavioral composition by checking desired properties of given behavioral models that are based on component state machines. However, writing state machine models for hundreds of software components manually is a labor-intensive process. This motivates work on automated model inference. In this paper, we present an approach to infer behavioral models for systems based on the Robot Operating System (ROS) using static analysis by exploiting assumptions about the usage of the ROS API and ecosystem. Our approach is based on searching for common behavioral patterns that ROS developers use for implementing reactive, periodic, and state-dependent behavior using the ROS framework API.We evaluate our approach and our tool ROSInfer on five complex real-world ROS systems with a total of 532 components. For this purpose we manually created 155 models of components from the source code to be used as a ground truth and available data set for other researchers. ROSInfer can infer causal triggers for 87 % of component architectural behaviors in the 532 components.",
      "thumbnail" : "/img/rosinfer.svg",
      "downloads" : [
      { "href"    : "https://github.com/rosqual/rosdiscover",
        "desc"    : "Tool"
      },
      {
        "href"    : "https://doi.org/10.1145/3597503.3639206",
        "desc"    : "Paper (Open Access)"
      }
    ]
  },
  
  ]
}
